![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 7.2 Dataframe in Pandas

Firt we import pandas:

In [1]:
import pandas as pd

Lets create this dictionary:

In [2]:
dict = {'name': ['bob', 'jake', 'sam', 'jone', 'sally','william'],
        'age': [23,34,41,29,19, 34], 'income': [72,65,49,39,81,55]}
dict

{'name': ['bob', 'jake', 'sam', 'jone', 'sally', 'william'],
 'age': [23, 34, 41, 29, 19, 34],
 'income': [72, 65, 49, 39, 81, 55]}

We can convert a dictionary into a pandas dataframe using the pandas function **pd.DataFrame()**:

In [3]:
dt1= pd.DataFrame(dict)
dt1

      name  age  income
0      bob   23      72
1     jake   34      65
2      sam   41      49
3     jone   29      39
4    sally   19      81
5  william   34      55

We can set the index to be any coloumn in the dataframe using the function **pd.set_index()**:

In [4]:
dt1.set_index('name', inplace = True)
dt1

         age  income
name
bob       23      72
jake      34      65
sam       41      49
jone      29      39
sally     19      81
william   34      55

To display the first five rows we use the function **head()**:

In [5]:
dt1.head()

       age  income
name
bob     23      72
jake    34      65
sam     41      49
jone    29      39
sally   19      81

To display the last five rows we use the function **tail()**:

In [6]:
dt1.tail()

         age  income
name
jake      34      65
sam       41      49
jone      29      39
sally     19      81
william   34      55

We can aslo display any number of rows like this:

In [7]:
dt1.head(6)

         age  income
name
bob       23      72
jake      34      65
sam       41      49
jone      29      39
sally     19      81
william   34      55

To display a certain column, we use this:

In [8]:
dt1.age

name
bob        23
jake       34
sam        41
jone       29
sally      19
william    34
Name: age, dtype: int64

The previous code can also be written like this:

In [9]:
dt1['age']

name
bob        23
jake       34
sam        41
jone       29
sally      19
william    34
Name: age, dtype: int64

To display a certain row, we use the function **loc[ ]**:

In [10]:
dt1.loc['jake']

age       34
income    65
Name: jake, dtype: int64

We can change the values of a certain column by assigning a new value:

In [11]:
dt1['income']= 100
dt1

         age  income
name
bob       23     100
jake      34     100
sam       41     100
jone      29     100
sally     19     100
william   34     100

To change a certain single value, we include the label of the column and the label of the index:

In [12]:
dt1['income']['jake'] =  50
dt1

         age  income
name
bob       23     100
jake      34      50
sam       41     100
jone      29     100
sally     19     100
william   34     100

The whole column can be replaced with a series, but in that case, index must be specified:

In [13]:
dt1['income'] = pd.Series([44,38,79,23,66,59],
                          index =['william', 'jake', 'sam', 'jone', 'sally','bob'] )
dt1

         age  income
name
bob       23      59
jake      34      38
sam       41      79
jone      29      23
sally     19      66
william   34      44

If we use a column name that does not exist in the dataframe, pandas will add it as a new column:

In [14]:
height = [5.6, 7.1, 6.8, 5.9, 6.1, 5.8 ]
dt1['heights'] = height
dt1

         age  income  heights
name
bob       23      59      5.6
jake      34      38      7.1
sam       41      79      6.8
jone      29      23      5.9
sally     19      66      6.1
william   34      44      5.8

We can delete a column using the **del** keyword:

In [15]:
del dt1['heights']
dt1

         age  income
name
bob       23      59
jake      34      38
sam       41      79
jone      29      23
sally     19      66
william   34      44

We can transpose (flipping rows and columns) using the attribute **.T**:

In [16]:
dt1.T

name    bob  jake  sam  jone  sally  william
age      23    34   41    29     19       34
income   59    38   79    23     66       44

The changes we make is not reflected in the original dataframe:

In [17]:
dt1

         age  income
name
bob       23      59
jake      34      38
sam       41      79
jone      29      23
sally     19      66
william   34      44

To get the lebels of the columns, we use the attribute **.columns**:

In [18]:
dt1.columns

Index(['age', 'income'], dtype='object')

To get the lebels of the columns, we use the attribute **.index**:

In [19]:
dt1.index

Index(['bob', 'jake', 'sam', 'jone', 'sally', 'william'], dtype='object', name='name')

***

<h1 align="center">Thank You</h1> 

***